DDam_OverInterDyMFoam/CASE30/backgroundAndMovingObject/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicOversetFvMesh;

dynamicOversetFvMeshCoeffs {}

solver          multiSolidBodyMotionSolver;

multiSolidBodyMotionSolverCoeffs
{
    movingZone1 
    {
    	solidBodyMotionFunction tabulated6DoFMotion;
    	tabulated6DoFMotionCoeffs
    	{
        	CofG            ( 0.9935 0.29 -0.18 );
        	timeDataFileName "$FOAM_CASE/constant/C00_wdisp.dat";
    	}
    }
    movingZone2
    {
    	solidBodyMotionFunction tabulated6DoFMotion;
    	tabulated6DoFMotionCoeffs
    	{
        	CofG            ( 1.9835 0.29 -0.18 );
        	timeDataFileName "$FOAM_CASE/constant/C00_wdisp.dat";
    	}
    }

}

// ************************************************************************* //
